<a href="https://colab.research.google.com/github/anupkumar888/Python_Programming/blob/Python-programming/1752_Day11_demo2_PRACTICE_Bayes'_Theorem.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Probability

## Demo 2: Bayes' Theorem

In this demo, you will be shown how to implement Bayes' theorem

##### Question:

Calculate the probability of number of female survived from titanic.csv dataset

##### Solution:

#### Step 1: Import libraries

In [1]:
import pandas as pd
import numpy as np

#### Step 2: Load titanic.csv dataset

In [3]:
titanic = pd.read_csv('/content/drive/MyDrive/PYTHON PROGRAMMING/Colab Notebooks/Statatistics/Day 11 - Demos/titanic.csv')
titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

#### Step 3: Print 2 columns i.e. Sex and Survived from the dataset

In [4]:
titanic = titanic[["Sex","Survived"]]

#Print top 10 row of given columns
titanic.head(10)

#Here 0= not survived and 1 = survived

      Sex  Survived
0    male         0
1  female         1
2  female         1
3  female         1
4    male         0
5    male         0
6    male         0
7    male         0
8  female         1
9  female         1

#### Step 4: Calculate number of people survived

In [8]:
# Total numbers of rows
num_rows = float(titanic.shape[0])
print("Toatal nos of rows:\t",num_rows)

survived_num=titanic[titanic["Survived"]==1]["Survived"].count()
print("Number of people survived=",survived_num)

Toatal nos of rows:	 891.0
Number of people survived= 342

#### Step 5: Calculate number of people not survived

In [9]:
not_survived_num=titanic[titanic["Survived"]==0]["Survived"].count()
print("Number of people not survived=",not_survived_num)

Number of people not survived= 549

#### Step 6: Calculate the probability of number of female survived

In [15]:
len(titanic[(titanic["Survived"]==1)&(titanic["Sex"]=="female")])/len(titanic[titanic.Sex=="female"])

0.7420382165605095

#### Conclusion: This code demonstrate how to implement Bayes' theorem